import type { ColorIconProps } from './types';

/**
 * ➕ AddIcon (추가 아이콘)
 *
 * 기본적으로 갈색색을 사용하며, 다른 색상을 원하면 `color` prop을 사용하세요.
 *
 * @component
 * @param {number} [size=18] - 아이콘의 너비 (상수값으로 입력해야 함.)
 * @param {string} [color='#764D4D'] - 아이콘 색상 (HEX, CSS 변수 모두 가능)
 * @param {React.SVGProps<SVGSVGElement>} props - 기타 SVG 속성 (예: className, aria-label 등)
 *
 * @example
 * // 기본 사용 (회색)
 * <AddIcon />
 *
 * @example
 * // 커스텀 색상 적용
 * <AddIcon color="#d2d2d2" size={20} />
 * @example
 * //Tailwind에서 정의한 CSS 변수 사용
 * <AddIcon color="var(--color-gray-300)" />
 */

const AddIcon = ({ size = 18, color = '#764D4D', ...props }: ColorIconProps) => {
  return (
    <svg fill='none' height={size} viewBox='0 0 18 18' width={size} {...props} xmlns='http://www.w3.org/2000/svg'>
      <path
        d='M7.67293 10.3266H1.9233C1.55088 10.3266 1.23659 10.1985 0.980433 9.94237C0.724272 9.6862 0.596191 9.37192 0.596191 8.99952C0.596191 8.62712 0.724272 8.31284 0.980433 8.05668C1.23659 7.80052 1.55088 7.67244 1.9233 7.67244H7.67293V1.92282C7.67293 1.5504 7.80101 1.23611 8.05717 0.979945C8.31333 0.723784 8.62761 0.595703 9.00001 0.595703C9.37241 0.595703 9.68669 0.723784 9.94285 0.979945C10.199 1.23611 10.3271 1.5504 10.3271 1.92282V7.67244H16.0767C16.4491 7.67244 16.7634 7.80052 17.0196 8.05668C17.2758 8.31284 17.4038 8.62712 17.4038 8.99952C17.4038 9.37192 17.2758 9.6862 17.0196 9.94237C16.7634 10.1985 16.4491 10.3266 16.0767 10.3266H10.3271V16.0762C10.3271 16.4487 10.199 16.7629 9.94285 17.0191C9.68669 17.2753 9.37241 17.4033 9.00001 17.4033C8.62761 17.4033 8.31333 17.2753 8.05717 17.0191C7.80101 16.7629 7.67293 16.4487 7.67293 16.0762V10.3266Z'
        fill={color}
      />
    </svg>
  );
};

export default AddIcon;
